vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/adc.h
#define ADC_STATUS_ADCBUSY_Pos                _UINT32_(0)                                          /* (ADC_STATUS) ADC Busy Position */
#define ADC_STATUS_ADCBUSY_Msk                (_UINT32_(0x1) << ADC_STATUS_ADCBUSY_Pos)            /* (ADC_STATUS) ADC Busy Mask */
#define ADC_STATUS_ADCBUSY(value)             (ADC_STATUS_ADCBUSY_Msk & (_UINT32_(value) << ADC_STATUS_ADCBUSY_Pos)) /* Assignment of value for ADCBUSY in the ADC_STATUS register */
#define ADC_STATUS_Msk                        _UINT32_(0x00000001)                                 /* (ADC_STATUS) Register Mask  */


/* -------- ADC_COMMAND : (ADC Offset: 0x48) (R/W 32) Command -------- */
#define ADC_COMMAND_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_COMMAND) Command  Reset Value */

#define ADC_COMMAND_START_Pos                 _UINT32_(0)                                          /* (ADC_COMMAND) Start Conversion Position */
#define ADC_COMMAND_START_Msk                 (_UINT32_(0x7) << ADC_COMMAND_START_Pos)             /* (ADC_COMMAND) Start Conversion Mask */
#define ADC_COMMAND_START(value)              (ADC_COMMAND_START_Msk & (_UINT32_(value) << ADC_COMMAND_START_Pos)) /* Assignment of value for START in the ADC_COMMAND register */
#define   ADC_COMMAND_START_STOP_Val          _UINT32_(0x0)                                        /* (ADC_COMMAND) Stop an ongoing conversion  */
#define   ADC_COMMAND_START_IMMEDIATE_Val     _UINT32_(0x1)                                        /* (ADC_COMMAND) Start a conversion immediately. This bit will be reset to STOP when the conversion is complete, unless Free-Running mode is enabled.  */
#define   ADC_COMMAND_START_INPUT_Val         _UINT32_(0x2)                                        /* (ADC_COMMAND) Start a conversion when a write to the INPUTCTRL register is performed  */
#define   ADC_COMMAND_START_EVENT_Val         _UINT32_(0x4)                                        /* (ADC_COMMAND) Start a conversion when an event is received by the ADC. This requires EVCTRL.STARTEI to be set to '1'.  */
#define ADC_COMMAND_START_STOP                (ADC_COMMAND_START_STOP_Val << ADC_COMMAND_START_Pos) /* (ADC_COMMAND) Stop an ongoing conversion Position */
#define ADC_COMMAND_START_IMMEDIATE           (ADC_COMMAND_START_IMMEDIATE_Val << ADC_COMMAND_START_Pos) /* (ADC_COMMAND) Start a conversion immediately. This bit will be reset to STOP when the conversion is complete, unless Free-Running mode is enabled. Position */
#define ADC_COMMAND_START_INPUT               (ADC_COMMAND_START_INPUT_Val << ADC_COMMAND_START_Pos) /* (ADC_COMMAND) Start a conversion when a write to the INPUTCTRL register is performed Position */
#define ADC_COMMAND_START_EVENT               (ADC_COMMAND_START_EVENT_Val << ADC_COMMAND_START_Pos) /* (ADC_COMMAND) Start a conversion when an event is received by the ADC. This requires EVCTRL.STARTEI to be set to '1'. Position */
#define ADC_COMMAND_MODE_Pos                  _UINT32_(4)                                          /* (ADC_COMMAND) Mode Position */
#define ADC_COMMAND_MODE_Msk                  (_UINT32_(0x7) << ADC_COMMAND_MODE_Pos)              /* (ADC_COMMAND) Mode Mask */
#define ADC_COMMAND_MODE(value)               (ADC_COMMAND_MODE_Msk & (_UINT32_(value) << ADC_COMMAND_MODE_Pos)) /* Assignment of value for MODE in the ADC_COMMAND register */
#define   ADC_COMMAND_MODE_NONE_Val           _UINT32_(0x0)                                        /* (ADC_COMMAND) None  */
#define   ADC_COMMAND_MODE_SINGLE_Val         _UINT32_(0x1)                                        /* (ADC_COMMAND) Single conversion  */
#define   ADC_COMMAND_MODE_SERIES_Val         _UINT32_(0x2)                                        /* (ADC_COMMAND) Series mode with accumulation, using a separate trigger for each conversion  */
#define   ADC_COMMAND_MODE_BURST_Val          _UINT32_(0x3)                                        /* (ADC_COMMAND) Burst mode with accumulation. A single trigger will initiate the number of conversions configured by CTRLD.SAMPNUM in one sequence.  */
#define   ADC_COMMAND_MODE_ACCTEST_Val        _UINT32_(0x7)                                        /* (ADC_COMMAND) Accumulator diagnostics mode  */
#define ADC_COMMAND_MODE_NONE                 (ADC_COMMAND_MODE_NONE_Val << ADC_COMMAND_MODE_Pos)  /* (ADC_COMMAND) None Position */
#define ADC_COMMAND_MODE_SINGLE               (ADC_COMMAND_MODE_SINGLE_Val << ADC_COMMAND_MODE_Pos) /* (ADC_COMMAND) Single conversion Position */
#define ADC_COMMAND_MODE_SERIES               (ADC_COMMAND_MODE_SERIES_Val << ADC_COMMAND_MODE_Pos) /* (ADC_COMMAND) Series mode with accumulation, using a separate trigger for each conversion Position */
#define ADC_COMMAND_MODE_BURST                (ADC_COMMAND_MODE_BURST_Val << ADC_COMMAND_MODE_Pos) /* (ADC_COMMAND) Burst mode with accumulation. A single trigger will initiate the number of conversions configured by CTRLD.SAMPNUM in one sequence. Position */
#define ADC_COMMAND_MODE_ACCTEST              (ADC_COMMAND_MODE_ACCTEST_Val << ADC_COMMAND_MODE_Pos) /* (ADC_COMMAND) Accumulator diagnostics mode Position */
#define ADC_COMMAND_DIFF_Pos                  _UINT32_(7)                                          /* (ADC_COMMAND) Differential Mode Position */
#define ADC_COMMAND_DIFF_Msk                  (_UINT32_(0x1) << ADC_COMMAND_DIFF_Pos)              /* (ADC_COMMAND) Differential Mode Mask */
#define ADC_COMMAND_DIFF(value)               (ADC_COMMAND_DIFF_Msk & (_UINT32_(value) << ADC_COMMAND_DIFF_Pos)) /* Assignment of value for DIFF in the ADC_COMMAND register */
#define ADC_COMMAND_Msk                       _UINT32_(0x000000F7)                                 /* (ADC_COMMAND) Register Mask  */


/* -------- ADC_RESULT : (ADC Offset: 0x50) (R/W 32) Result -------- */
#define ADC_RESULT_RESETVALUE                 _UINT32_(0x00)                                       /*  (ADC_RESULT) Result  Reset Value */

#define ADC_RESULT_RESULT_Pos                 _UINT32_(0)                                          /* (ADC_RESULT) ADC Result Position */
#define ADC_RESULT_RESULT_Msk                 (_UINT32_(0xFFFFFFFF) << ADC_RESULT_RESULT_Pos)      /* (ADC_RESULT) ADC Result Mask */
#define ADC_RESULT_RESULT(value)              (ADC_RESULT_RESULT_Msk & (_UINT32_(value) << ADC_RESULT_RESULT_Pos)) /* Assignment of value for RESULT in the ADC_RESULT register */
#define ADC_RESULT_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (ADC_RESULT) Register Mask  */


/* -------- ADC_SAMPLE : (ADC Offset: 0x54) (R/W 32) Sample -------- */
#define ADC_SAMPLE_RESETVALUE                 _UINT32_(0x00)                                       /*  (ADC_SAMPLE) Sample  Reset Value */

#define ADC_SAMPLE_SAMPLE_Pos                 _UINT32_(0)                                          /* (ADC_SAMPLE) ADC Sample Position */
#define ADC_SAMPLE_SAMPLE_Msk                 (_UINT32_(0xFFFF) << ADC_SAMPLE_SAMPLE_Pos)          /* (ADC_SAMPLE) ADC Sample Mask */
#define ADC_SAMPLE_SAMPLE(value)              (ADC_SAMPLE_SAMPLE_Msk & (_UINT32_(value) << ADC_SAMPLE_SAMPLE_Pos)) /* Assignment of value for SAMPLE in the ADC_SAMPLE register */
#define ADC_SAMPLE_Msk                        _UINT32_(0x0000FFFF)                                 /* (ADC_SAMPLE) Register Mask  */


/* -------- ADC_DBGCTRL : (ADC Offset: 0x6C) (R/W 32) Debug Control -------- */
#define ADC_DBGCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_DBGCTRL) Debug Control  Reset Value */

#define ADC_DBGCTRL_DBGRUN_Pos                _UINT32_(0)                                          /* (ADC_DBGCTRL) Debug Run Position */
#define ADC_DBGCTRL_DBGRUN_Msk                (_UINT32_(0x1) << ADC_DBGCTRL_DBGRUN_Pos)            /* (ADC_DBGCTRL) Debug Run Mask */
#define ADC_DBGCTRL_DBGRUN(value)             (ADC_DBGCTRL_DBGRUN_Msk & (_UINT32_(value) << ADC_DBGCTRL_DBGRUN_Pos)) /* Assignment of value for DBGRUN in the ADC_DBGCTRL register */
#define ADC_DBGCTRL_Msk                       _UINT32_(0x00000001)                                 /* (ADC_DBGCTRL) Register Mask  */


/* -------- ADC_WPCTRL : (ADC Offset: 0x7C) (R/W 32) Write Protection Control -------- */
#define ADC_WPCTRL_RESETVALUE                 _UINT32_(0x00)                                       /*  (ADC_WPCTRL) Write Protection Control  Reset Value */

#define ADC_WPCTRL_WPEN_Pos                   _UINT32_(0)                                          /* (ADC_WPCTRL) Write Protection Enable Position */
#define ADC_WPCTRL_WPEN_Msk                   (_UINT32_(0x1) << ADC_WPCTRL_WPEN_Pos)               /* (ADC_WPCTRL) Write Protection Enable Mask */
#define ADC_WPCTRL_WPEN(value)                (ADC_WPCTRL_WPEN_Msk & (_UINT32_(value) << ADC_WPCTRL_WPEN_Pos)) /* Assignment of value for WPEN in the ADC_WPCTRL register */
#define ADC_WPCTRL_WPLCK_Pos                  _UINT32_(1)                                          /* (ADC_WPCTRL) Write Protection Lock Position */
#define ADC_WPCTRL_WPLCK_Msk                  (_UINT32_(0x1) << ADC_WPCTRL_WPLCK_Pos)              /* (ADC_WPCTRL) Write Protection Lock Mask */
#define ADC_WPCTRL_WPLCK(value)               (ADC_WPCTRL_WPLCK_Msk & (_UINT32_(value) << ADC_WPCTRL_WPLCK_Pos)) /* Assignment of value for WPLCK in the ADC_WPCTRL register */
#define ADC_WPCTRL_WPKEY_Pos                  _UINT32_(8)                                          /* (ADC_WPCTRL) Write Protection Key Position */
#define ADC_WPCTRL_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << ADC_WPCTRL_WPKEY_Pos)         /* (ADC_WPCTRL) Write Protection Key Mask */
#define ADC_WPCTRL_WPKEY(value)               (ADC_WPCTRL_WPKEY_Msk & (_UINT32_(value) << ADC_WPCTRL_WPKEY_Pos)) /* Assignment of value for WPKEY in the ADC_WPCTRL register */
#define   ADC_WPCTRL_WPKEY_KEY_Val            _UINT32_(0x414443)                                   /* (ADC_WPCTRL) Allow writes to the WPCTRL register  */
#define ADC_WPCTRL_WPKEY_KEY                  (ADC_WPCTRL_WPKEY_KEY_Val << ADC_WPCTRL_WPKEY_Pos)   /* (ADC_WPCTRL) Allow writes to the WPCTRL register Position */
#define ADC_WPCTRL_Msk                        _UINT32_(0xFFFFFF03)                                 /* (ADC_WPCTRL) Register Mask  */


