vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/adc.h
/* ADC register offsets definitions */
#define ADC_CTRLA_REG_OFST             _UINT32_(0x00)      /* (ADC_CTRLA) Control A Offset */
#define ADC_CTRLB_REG_OFST             _UINT32_(0x04)      /* (ADC_CTRLB) Control B Offset */
#define ADC_CTRLC_REG_OFST             _UINT32_(0x08)      /* (ADC_CTRLC) Control C Offset */
#define ADC_CTRLD_REG_OFST             _UINT32_(0x0C)      /* (ADC_CTRLD) Control D Offset */
#define ADC_CTRLE_REG_OFST             _UINT32_(0x10)      /* (ADC_CTRLE) Control E Offset */
#define ADC_WINCTRL_REG_OFST           _UINT32_(0x1C)      /* (ADC_WINCTRL) Window Control Offset */
#define ADC_WINLT_REG_OFST             _UINT32_(0x20)      /* (ADC_WINLT) Window Low Threshold Offset */
#define ADC_WINHT_REG_OFST             _UINT32_(0x24)      /* (ADC_WINHT) Window High Threshold Offset */
#define ADC_INPUTCTRL_REG_OFST         _UINT32_(0x28)      /* (ADC_INPUTCTRL) Input Multiplexer Control Offset */
#define ADC_EVCTRL_REG_OFST            _UINT32_(0x2C)      /* (ADC_EVCTRL) Event Control Offset */
#define ADC_INTENCLR_REG_OFST          _UINT32_(0x30)      /* (ADC_INTENCLR) Interrupt Enable Clear Offset */
#define ADC_INTENSET_REG_OFST          _UINT32_(0x34)      /* (ADC_INTENSET) Interrupt Enable Set Offset */
#define ADC_INTFLAG_REG_OFST           _UINT32_(0x38)      /* (ADC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define ADC_INTFLAGSET_REG_OFST        _UINT32_(0x3C)      /* (ADC_INTFLAGSET) Interrupt Flag Set Offset */
#define ADC_STATUS_REG_OFST            _UINT32_(0x40)      /* (ADC_STATUS) Status Offset */
#define ADC_COMMAND_REG_OFST           _UINT32_(0x48)      /* (ADC_COMMAND) Command Offset */
#define ADC_RESULT_REG_OFST            _UINT32_(0x50)      /* (ADC_RESULT) Result Offset */
#define ADC_SAMPLE_REG_OFST            _UINT32_(0x54)      /* (ADC_SAMPLE) Sample Offset */
#define ADC_DBGCTRL_REG_OFST           _UINT32_(0x6C)      /* (ADC_DBGCTRL) Debug Control Offset */
#define ADC_WPCTRL_REG_OFST            _UINT32_(0x7C)      /* (ADC_WPCTRL) Write Protection Control Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* ADC register API structure */
typedef struct
{  /* Analog-to-Digital Converter */
  __IO  uint32_t                       ADC_CTRLA;          /* Offset: 0x00 (R/W  32) Control A */
  __IO  uint32_t                       ADC_CTRLB;          /* Offset: 0x04 (R/W  32) Control B */
  __IO  uint32_t                       ADC_CTRLC;          /* Offset: 0x08 (R/W  32) Control C */
  __IO  uint32_t                       ADC_CTRLD;          /* Offset: 0x0C (R/W  32) Control D */
  __IO  uint32_t                       ADC_CTRLE;          /* Offset: 0x10 (R/W  32) Control E */
  __I   uint8_t                        Reserved1[0x08];
  __IO  uint32_t                       ADC_WINCTRL;        /* Offset: 0x1C (R/W  32) Window Control */
  __IO  uint32_t                       ADC_WINLT;          /* Offset: 0x20 (R/W  32) Window Low Threshold */
  __IO  uint32_t                       ADC_WINHT;          /* Offset: 0x24 (R/W  32) Window High Threshold */
  __IO  uint32_t                       ADC_INPUTCTRL;      /* Offset: 0x28 (R/W  32) Input Multiplexer Control */
  __IO  uint32_t                       ADC_EVCTRL;         /* Offset: 0x2C (R/W  32) Event Control */
  __IO  uint32_t                       ADC_INTENCLR;       /* Offset: 0x30 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       ADC_INTENSET;       /* Offset: 0x34 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       ADC_INTFLAG;        /* Offset: 0x38 (R/W  32) Interrupt Flag Status and Clear */
  __IO  uint32_t                       ADC_INTFLAGSET;     /* Offset: 0x3C (R/W  32) Interrupt Flag Set */
  __I   uint32_t                       ADC_STATUS;         /* Offset: 0x40 (R/   32) Status */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       ADC_COMMAND;        /* Offset: 0x48 (R/W  32) Command */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       ADC_RESULT;         /* Offset: 0x50 (R/W  32) Result */
  __IO  uint32_t                       ADC_SAMPLE;         /* Offset: 0x54 (R/W  32) Sample */
  __I   uint8_t                        Reserved4[0x14];
  __IO  uint32_t                       ADC_DBGCTRL;        /* Offset: 0x6C (R/W  32) Debug Control */
  __I   uint8_t                        Reserved5[0x0C];
  __IO  uint32_t                       ADC_WPCTRL;         /* Offset: 0x7C (R/W  32) Write Protection Control */
} adc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMPL10_ADC_COMPONENT_H_ */
